snlkuharlocal/src/Documents/АктВыполненныхРаботАсу/АктВыполненныхРаботАсу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктВыполненныхРаботАсу</name>
  <basedOn>Document.ЗадачиАСУ</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗадачиАСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗадачи</name>
    <type>
      <types>CatalogRef.СостояниеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>НичегоНеДелалось</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Задачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>DocumentRef.ЗадачиАСУ</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеВыполнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>CatalogRef.СостояниеЗадачи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеФайлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/АктВыполненныхРаботАсу/Forms/УпрФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если не ПроверкаЗаполненностиЭлементов() тогда
		Отказ=Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Функция ПроверкаЗаполненностиЭлементов()
	Результат=Истина;
	если Не ЗначениеЗаполнено(Объект.СостояниеЗадачи) тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните состояние задачи";
		Сообщение.Сообщить();
		Результат= ложь;
	КонецЕсли;
	
	если Не ЗначениеЗаполнено(Объект.Исполнитель) тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните исполнителя";
		Сообщение.Сообщить();
		Результат= ложь;
	КонецЕсли;
	
	если Не ЗначениеЗаполнено(Объект.ОписаниеВыполнения) тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните описание выполнения";
		Сообщение.Сообщить();
		Результат= ложь;
	КонецЕсли;
	
	
	возврат Результат;
КонецФункции


&НаКлиенте
Процедура УправлениеВидимостью()
	
КонецПроцедуры

// Андреев И.Д. 02.06.2022 начало
// Для вложенных файлов

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	//если Объект.Ссылка.Пустая() тогда
	//	Сообщить("Перед прикреплением файла нужно записать документ");
	//	Возврат;
	//КонецЕсли;
	
// Андреев И.Д. 14.11.2022 начало

	если Параметры.Ключ.Пустая() тогда
		новыйДок = истина;
	Иначе
		новыйДок = ложь;
	Конецесли;
	
	Если новыйДок = Истина тогда
		Сообщить("Это новый документ, для прикрепления файла нужно записать документ");
		Возврат
	иначе
 
// Андреев И.Д. 14.11.2022 конец
		
	
	ПолныйПуть=Истина;	
	ДиалогВыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	//ДиалогВыбораФайла.ПолноеИмяФайла				=	Элемент.Значение;
	//ДиалогВыбораФайла.ПолноеИмяФайла				=	Элемент.ТекстРедактирования;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ФайлИсточник	= Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		
		КорневойКаталог= ПолучитьКаталогСохраненияПрикрепленныхФайлов(Объект.Ссылка);
		// Кухарь А.Ю. 06.04.2021 начало
		//КопироватьФайл(ДиалогВыбораФайла.ПолноеИмяФайла, КорневойКаталог+"\"+ФайлИсточник.имя);
		ДД=новый ДвоичныеДанные(ДиалогВыбораФайла.ПолноеИмяФайла);
		//ФайлДляСервера=ПоместитьВоВременноеХранилище(ДД,новый УникальныйИдентификатор);
		
		копироватьФайл(ДиалогВыбораФайла.ПолноеИмяФайла, КорневойКаталог+"\"+ФайлИсточник.имя); 
		
		//СкопироватьФайлНаСервере(ФайлДляСервера,КорневойКаталог+"\"+ФайлИсточник.имя);
		// Кухарь А.Ю. 06.04.2021 конец
		
		ТЧ=Объект.ВложенныеФайлы.Добавить();
		ТЧ.ИмяФайла = ФайлИсточник.имя;
		
		//ЗаполнитьПрикрепленныеФайлы();
	КонецЕсли;
	
	ЭтотОбъект.Записать();
	Конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ВложенныеФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФайл(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайлНажатие(команда)
	
	ТекущаяСтрока=элементы.ВложенныеФайлы.Текущиеданные;
	
	если ТекущаяСтрока<>Неопределено тогда
		//ИмяФайла=ТекущаяСтрока.ИмяФайла;
		КорневойКаталог=ПолучитьКаталогСохраненияПрикрепленныхФайлов(объект.Ссылка);
		
		УдалитьФайлы(КорневойКаталог+"\"+ТекущаяСтрока.ИмяФайла);
		//КонецЕсли;		
		// Кухарь А.Ю. 06.04.2021 конец	
		
	КонецЕсли;	
	Объект.ВложенныеФайлы.Удалить(элементы.ВложенныеФайлы.Текущиеданные.номерСтроки-1);
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПрикрепленныеФайлы()
	объект.ВложенныеФайлы.Очистить();
	если не объект.Ссылка.Пустая() тогда
		запрос=новый запрос;
		запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрикрепленныеФайлы.ИмяФайла КАК ИмяФайла
		|ИЗ
		|	РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
		|ГДЕ
		|	ПрикрепленныеФайлы.Владелец = &Владелец";
		запрос.УстановитьПараметр("Владелец",объект.Ссылка);
		Результат=запрос.Выполнить().Выбрать();
		пока Результат.Следующий() цикл
			СтрТЧ=объект.ВложенныеФайлы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЧ,Результат);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Кухарь А.Ю. 06.04.2021 начало
//
&НаСервере
Процедура СкопироватьФайлНаСервере(ФайлДляСервера,ПутьКФайлу)
	ДД=ПолучитьИзВременногоХранилища(ФайлДляСервера);
	ДД.записать(ПутьКФайлу);
КонецПроцедуры

&НаСервере
Функция ПолучитьФайлССервера (ПутьКФайлу)
	Файл = новый Файл(ПутьКФайлу);
	если файл.Существует() тогда			
		ДД=новый ДвоичныеДанные(ПутьКФайлу);
		ФайлДляСервера=ПоместитьВоВременноеХранилище(ДД,новый УникальныйИдентификатор);
		Возврат ФайлДляСервера;
	иначе
		возврат Неопределено;
	КонецЕсли;			
КонецФункции

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ТекущаяСтрока=Элементы.ВложенныеФайлы.ТекущиеДанные;
	если ТекущаяСтрока<>Неопределено тогда
		ИмяФайла=ТекущаяСтрока.ИмяФайла;
		
		КорневойКаталог = ПолучитьКаталогСохраненияПрикрепленныхФайлов(Объект.Ссылка);
		
		// Кухарь А.Ю. 06.04.2021 начало
		//Файл = новый Файл(КорневойКаталог+"\"+ИмяФайла);
		//если файл.Существует() тогда
		//	ЗапуститьПриложение(КорневойКаталог+"\"+ИмяФайла);
		//КонецЕсли;		
		Хран=ПолучитьФайлССервера (КорневойКаталог+"\"+ИмяФайла);
		если Хран<>Неопределено тогда
			ДД=ПолучитьИзВременногоХранилища(Хран);
			ДД.записать(КаталогВременныхФайлов()+"\"+ИмяФайла);
			ЗапуститьПриложение(КаталогВременныхФайлов()+"\"+ИмяФайла);
		КонецЕсли;		
		// Кухарь А.Ю. 06.04.2021 конец
	КонецЕсли;
КонецПроцедуры


&наКлиенте
Функция ПолучитьКаталогСохраненияПрикрепленныхФайлов (Документ)
	
	если ложь тогда документ=Документы.ВзаимодействиеСКонтрагентом.ПустаяСсылка();КонецЕсли;
	КорневойКаталог = Константы.КаталогВнешнихОтчетов.Получить();
	КаталогДокумента=КорневойКаталог+"Акт Выполненых работ\"+Документ.Метаданные().Имя+" "+Документ.Номер;
	
	Файл=новый Файл(КаталогДокумента);
	если  не Файл.Существует() тогда
		СоздатьКаталог(КаталогДокумента);
	КонецЕсли;
	возврат КаталогДокумента;
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры
// Андреев И.Д. 03.08.2022 начало

// Андреев И.Д. 09.08.2022 начало

&НаКлиенте
Процедура НичегоНеДелалосьПриИзменении(Элемент)
	Если Объект.НичегоНеДелалось тогда
		объект.ОписаниеВыполнения = "перенесена на следующую неделю";
	КонецЕсли;
КонецПроцедуры
//
